// --------------- 3. Операторы и выражения ----------------------
// 1 --------------------  Четные и Нечетные -------------------- 
let a=8;
console.log((a%2)>0 ? 'Не четное:' :'четное ',a);

// 2  --------------------  Деление на 4 и 7 --------------------  
let a= 27;
console.log(!!!(a%4>0 && a%7>0),a);

// 3 --------------------  Прямоугольники -------------------- 
let a=2.5,
    b=5.3;
console.log((Math.round((a*b)*100))/100, (Math.round((a+b)*4*100))/100);
// Вариант 2 используя .toFixed() 
console.log((a*b).toFixed(2), ((a+b)*4).toFixed(2));
// Вариант 3 используя toPrecision()
//Оба метода toFixed() и toPrecision() возвращают строковое представление результата, а не число. Получить число: parseFloat(Num.toFixed(4))
console.log((a*b).toPrecision(4), ((a+b)*4).toPrecision(4));  /* Похоже 4 - количество знаков общее: перед и после запятой */
// Вариант 4 используя Math.ceil() -округляет вверх
console.log((Math.ceil((a*b)*100))/100, (Math.ceil((a+b)*4*100))/100);
// Вариант 5 используя Math.floor() - округляет вниз
console.log((Math.floor((a*b)*100))/100, (Math.floor((a+b)*4*100))/100);
// Вариант 6 используя побитный сдвиг
console.log(((a*b*100)>>0)/100, (((a+b)*4*100)>>0)/100);

// 4  -------------------- Третья цифра 7 -------------------- 
let a=4795;
let res=(a/100) & 7;
console.log(res == 7); // true

// 5 --------------------  3-й бит -------------------- 
let a=7;
console.log((a&=4).toString(2)); // 100

// 6  -------------------- Точка в круге -------------------- 
let x=1.2,
    y=1.8;
var rad = Math.sqrt(Math.pow(x,2)+Math.pow(y,2));
console.log((rad >=2 ? 'Не входит' : 'Входит'), rad); // Не входит 2.1633307652783933

// 7 --------------------  Простое число  -------------------- 
let a = 11;
var res = (a>0 && (a%2)>0 && a%3>0 && a%5>0 && a%7>0);
console.log(res==true ? 'Простое': 'Нет'); // Простое

// 8 -------------------- Трапеции -------------------- 
let a = 1.45,
    b = 3.34,
    h = 44.21;
var s = (a+b)*h/2;
// console.log('Perc 10:',s.toPrecision(10));
console.log('Площадь:',s.toFixed(7)); // Площадь: 105.8829500

// 9 -------------------- Точка, круг и прямоугольник -------------------- 
let x = 1.3,
    y = 2.2;
var round = Math.sqrt(Math.pow(x-1,2) + Math.pow(y-1,2));
var rectangle = ( (x > -1 && x < 5) && (y > -1 && y < 1));
console.log(round >= 1.5 ? 'снаружи круга': 'в круге ');
console.log(rectangle == true ? 'в прямоугольникe': 'снаружи прямоугольника'); // в круге снаружи прямоугольника
